ХМНПФ_Общее/Documents/уп_ЗакрытиеДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ЗакрытиеДоговораОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПричиныЗакрытияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоПриказа742</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_НамНашИД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтролироватьОбязательства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяВыплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорыОПС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаСмерти</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаВступленияВДействие</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НадлежащийСтраховщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВосполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВозмещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ПричиныЗакрытияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияДоговораОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоСмерти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Досрочное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакрытПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АннулированиеЛицензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеВступилВСилу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоРешениюСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереходДосрочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоИнымПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъединениеСНИЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ПереносСредствНаДругойДоговорФизЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_НазначенаВыплатаПредыдущимСтраховщиком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ЗакрытиеДоговораОПС/Ext/ManagerModule.bsl
// +ХМНПФ 09.04.2021 ШадринАВ // уп_ЗакрытиеДоговораОПС // №3116
Процедура уп_ЗакрытиеДоговораОПС(Источник, Отказ, РежимПроведения) Экспорт
	Если Источник.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
		ТЗ_МСК = Источник.РасшифровкаСуммы.Выгрузить(Новый Структура("ТипСуммы",Справочники.уп_ТипыСуммОПС.МатКапитал));
		ТЗ_ИДМСК = Источник.РасшифровкаСуммы.Выгрузить(Новый Структура("ТипСуммы",Справочники.уп_ТипыСуммОПС.ИДМатКапитал));
		Для Каждого стрИД Из ТЗ_ИДМСК Цикл
			стрТЗ = ТЗ_МСК.Добавить();
			ЗаполнитьЗначенияСвойств(стрТЗ,стрИД);
		КонецЦикла;
		Если ТЗ_МСК.Количество()>0 Тогда
			ТЗ_МСК.Свернуть("ДоговорОПС");
			Для каждого стр Из ТЗ_МСК Цикл
				Сообщить("Есть суммы Материнского капитала на остатке у закрываемого 'По смерти' договора "+стр.ДоговорОПС+"
						|Сделано начисление с типом выплаты 'Возврат материнского капитала'. Необходимо сформировать выплатной реестр с этим типом выплаты.",СтатусСообщения.Важное);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // уп_ЗакрытиеДоговораОПС()



&ИзменениеИКонтроль("ДобавитьКомандыПечати")
Процедура РасшОбщ_ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрПФР";
	КомандаПечати.Представление = НСтр("ru = 'Реестр передаваемых сумм в ПФР'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 20;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр2010";
	КомандаПечати.Представление = НСтр("ru = 'Реестр передаваемых сумм (выделено софинансирование)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 30;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрXLS";
	КомандаПечати.Представление = НСтр("ru = 'Реестр передаваемых сумм (для загрузок)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 40;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение1";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 1 к Постановлению Правл.ПФР №177п от 20.05.2015'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 50;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение1_2";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 1 к Постановлению Правл.ПФР №177п от 20.05.2015 с адресом'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 60;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрАдресовЗЛ";
	КомандаПечати.Представление = НСтр("ru = 'Реестр адресов ЗЛ'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 70;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение2";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 2 к Постановлению Правл.ПФР №177п от 20.05.2015'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 80;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение2_2";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 2 к Постановлению Правл.ПФР №177п от 20.05.2015 с адресом'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 90;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрАдресовПравопреемников";
	КомандаПечати.Представление = НСтр("ru = 'Реестр адресов правопреемников'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 100;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение3";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 3 к Постановлению Правл.ПФР №177п от 20.05.2015'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 110;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаявленияПравопреемников";
	КомандаПечати.Представление = НСтр("ru = 'Заявления правопреемников'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 120;

	
	#Вставка
	// +ХМНПФ 21.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №1980
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьУведомленийПерешедшимВДругойПФ";
	КомандаПечати.Представление = НСтр("ru = 'Печать уведомлений перешедшим в другой ПФ'");
	КомандаПечати.Обработчик    = "ХМ_ОбщийМодульПечатныеФормы.ОбработкаКомандыПечатиУведомленийПерешедшимВДругойПФ";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента";
	КомандаПечати.Порядок = 130;
	// -ХМНПФ 21.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №1980
	
	// +ХМНПФ 23.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №2004
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьПочтовогоРеестраПоПерешедшимВДругойПФ";
	КомандаПечати.Представление = НСтр("ru = 'Печать почтового реестра по перешедшим в другой ПФ'");
	КомандаПечати.Обработчик    = "ХМ_ОбщийМодульПечатныеФормы.ОбработкаКомандыПечатиПочтовогоРеестраПоПерешедшимВДругойПФ";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента";
	КомандаПечати.Порядок = 140;
	// -ХМНПФ 23.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №2004
	#КонецВставки
	//КомандаПечати.ДополнитьКомплектВнешнимиПечатнымиФормами=Истина;
КонецПроцедуры

#Область ХМНПФ

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 21.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №1980
	// ХМНПФ 23.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №2004
КонецПроцедуры

#КонецОбласти
